{
  "Interviewer": [
    "Hey, hi Manish. So, welcome today. Let's discuss a pair robustness. How do you",
    "approach designing your scalable distributed API rate limiter",
    "So what are your core goals?",
    "That you want to try achieve here.",
    "Okay, that's a good one. So let's assume the requirements issue limit a client",
    "to hundred requests per minute. So what architecture layer would you place this",
    "logic in and why",
    "Can you briefly explain that one?",
    "How that makes sense. So Now let's talk about the implementation. So there are",
    "several algorithms. So which one would you choose? And why?",
    "Oh, so why that one over and say that a fixed window counter?",
    "Okay, that makes sense.",
    "So given the need of high speed read Write access and distribution across",
    "multiple Gateway instances. What kind of data store would you like to maintain",
    "the request count?",
    "Okay, so in a distributed setup, with multiple API, gateways talking to the same",
    "radius cluster, how do you ensure that operations? Checking the count and then",
    "incrementing it up performed atomically to avoid the race conditions.",
    "Okay, so one last quotation. So, how do we identify the client? We are limiting",
    "how we use the IP address.",
    "Oh, that's perfect. Like I mean I got what are all the information that I'm",
    "looking for? Thanks for joining the call. Manish have a good day."
  ],
  "Manish Reddy": [
    "Hi, thanks for the introduction.",
    "So the main goals are like a prediction and fairness uses of our service. So we",
    "want to protect our backend services from being overhand by a sudden surge in",
    "request",
    "either those can be malicious or accidental, which prevents so which degradation",
    "So this fairness ensures that one heavy user doesn't consume all the resources",
    "and impact embedding the others.",
    "Sure, I would place the rate limiter in API Gateway or maybe in a dedicated, its",
    "service. So, this acts as a shield, if we put it in a application logic. But",
    "this would block all the requests still consume resources like opening and",
    "closing the connections or routing to the application. So which defeats the",
    "major purpose of here, what we were trying to achieve. So the gateway drops the",
    "request before it even reaches government application.",
    "The common ones are like most usually or they're like a fixed window sliding",
    "window and sliding window counter. I would select the sliding window counter",
    "algorithm.",
    "At the fixed window counter is it's a simple but suffers from boundary problem.",
    "If the limit resets at 100 seconds, a user sends hundred requested 59th second",
    "and 100 more at 0 1 per second. So effectively sending 200 seconds in two",
    "seconds. So the sliding window counter mitigates. This what is the flow of",
    "traffic by waiting? The request count from the previous window and combining it",
    "with the current one so which helps us in a smooth. Transition enforcement.",
    "I would like to use something like in memory store Like Redis. It offers the low",
    "latency and high throughput required to check and upgrade the counts for every",
    "API request. So the radiation database would introduce too much latency here.",
    "So like we must use atomic operations specifically, like already saw first",
    "commands, like incr, or we could even make use of this Luca scripts for more",
    "complex, logics where we can use them within the radius.",
    "so, this ensures the operations are treated as a single unit and then preventing",
    "two different requests have been",
    "To I mean two concurrent request some mistakenly getting through the limit is",
    "reach.",
    "So we also set an appropriate a time to live on the key matching, our window",
    "duration, so we can have like some 60 second implemented. So we can make use of",
    "this increment counter in the radius and get this updated.",
    "So using the IP address is risky because let's say a group of college students",
    "are connected to a same college Wi-Fi, and their access in the platform. So are",
    "we going to",
    "District all of them. No, right. So that case, like we would be needing some",
    "like some authentication mechanism here. So I can think of, like two approaches.",
    "Maybe the first one we can have some unique identify who's ready? Maybe. We can",
    "extract it from a JW token or maybe we can pass an X API key to the headers.",
    "Thank you."
  ]
}