{
  "Interviewer": [
    "Hi, Manish. So welcome. Today let's discuss a pair of business. How do you approach design?",
    "So welcome today let's discuss a pair of business. How do you approach design?",
    "How do you approach design?",
    "service. So we want to protect our pack and services from being overhead by a sudden surge in request. Either that those can be malicious or",
    "from being overhead by a sudden surge in requests. Either that, those can be malicious or...",
    "request. Either that those can be malicious or I",
    "and closing the connections or routing to the application. So which defeats the major purpose of here what we are trying to do.",
    "purpose of here what we are trying to do.",
    "say that or fix a window counter."
  ],
  "Manish Reddy": [
    "you",
    "you",
    "you you",
    "you",
    "What are your core goals that you want to try to achieve here? Thanks for the introduction.",
    "achieve here. Thanks for the introduction.",
    "Thanks for the introduction.",
    "So this fineness ensures that one heavy user doesn't consume all the resources and impacting the others.",
    "all the resources and impacting the others.",
    "Okay, that's a good one. So let's assume the requirements issue limit a client to 100 requests per minute. So what architecture layer would",
    "client to 100 requests per minute. So what architecture layer would",
    "place this logic in and why? Can you briefly explain that one?",
    "So, I would place the red limiter in a API gateway or maybe in a dedicated X service. So, this acts as a shield if we put it in an application logic.",
    "I would place the red limiter in a API gateway or maybe in a dedicated it service. So this acts as a shield if we put it in an application logic.",
    "So this acts as a shield if we put it in a application logic.",
    "our main application. That makes sense. Now let's talk about the implementation. There are several algorithms.",
    "That makes sense. So now let's talk about the implementation. So there are several algorithms.",
    "There are several algorithms.",
    "and why. The common ones are like most usually are they like a fixed window, sliding window and sliding window counter. I would select the sliding window counter algorithm.",
    "The common ones are like most usually, or like a fixed window, sliding window and sliding window counter. I would select the sliding window counter algorithm.",
    "of its window, sliding window and sliding window counter. I would select the sliding window counter algorithm.",
    "Health Ad- time.",
    "by the fixed window"
  ]
}